In [1]:
import pandas as pd
import numpy as np

In [7]:
dict1={'Name':['Ramesh','Suresh','Satish',np.nan],
       'Age': [30,33,np.nan,36],
       'City':[np.nan,'Hyd','Hyd','Blr']}

In [9]:
data=pd.DataFrame(dict1)

In [11]:
data

     Name   Age City
0  Ramesh  30.0  NaN
1  Suresh  33.0  Hyd
2  Satish   NaN  Hyd
3     NaN  36.0  Blr

In [19]:
data.to_csv('data1.csv',index=False)

In [21]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

 - drop the null values data based on rows and columns

In [25]:
# I ant to extract the data with out NUll values
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [27]:
data

     Name   Age City
0  Ramesh  30.0  NaN
1  Suresh  33.0  Hyd
2  Satish   NaN  Hyd
3     NaN  36.0  Blr

In [29]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [31]:
dict1={'Name':['Ramesh','Suresh','Satish',np.nan],
       'Age': [30,33,np.nan,36],
       'City':[np.nan,'Hyd','Hyd','Blr'],
      'Company':['Google','Microsoft','Apple','Meta']}
data1=pd.DataFrame(dict1)
data1

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [33]:
data1.dropna(axis=1)

     Company
0     Google
1  Microsoft
2      Apple
3       Meta

**fillna**

In [38]:
data1.fillna(30)

     Name   Age City    Company
0  Ramesh  30.0   30     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  30.0  Hyd      Apple
3      30  36.0  Blr       Meta

In [42]:
data1['Name'].fillna('Manish')

0    Ramesh
1    Suresh
2    Satish
3    Manish
Name: Name, dtype: object

**Draw Back: Filling with Random value is not a good Approach**

- To avaoid the we have some methods

   - backfill
   - bfill
   - ffill
   - pad

**pad**

In [50]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  Blr       Meta

In [56]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad',axis=1)

     Name     Age  City    Company
0  Ramesh    30.0  30.0     Google
1  Suresh    33.0   Hyd  Microsoft
2  Satish  Satish   Hyd      Apple
3     NaN    36.0   Blr       Meta

In [58]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='ffill')

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  Blr       Meta

In [60]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='bfill')

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  Blr       Meta

In [62]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='backfill')

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  Blr       Meta

**Mean  Median   Mode**

In [65]:
#step-1: select the column
#step-2: get the mean
#step-3: apply fill na

age_mean=data1['Age'].mean()
print('age_mean:',age_mean)
data1['Age'].fillna(age_mean)

age_mean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [69]:
city_mode=data1['City'].mode()
city_mode.values[0]

'Hyd'

**impute class**
- Under sklearn we have impute class is there

In [72]:
from sklearn import impute

In [74]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [76]:
import numpy as np
from sklearn.impute import KNNImputer
X = [[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer =KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(X)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [78]:
import numpy as np
from sklearn.impute import KNNImputer
X = [[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer =KNNImputer(n_neighbors=2,weights='distance')
imputer.fit_transform(X)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])